
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Объект.ИмяПредопределенныхДанных = "ИмяФайлаЗагрузки" тогда
		КвалификаторыСтроки = Новый КвалификаторыСтроки(255);
		ОписаниеТипаСтрока = Новый ОписаниеТипов("Строка", ,КвалификаторыСтроки);
		Элементы.Значение.ОграничениеТипа =  ОписаниеТипаСтрока;
	ИначеЕсли Объект.ИмяПредопределенныхДанных = "Пароль" тогда
		Элементы.Значение.РежимПароля = Истина;	
	Иначе 
		Элементы.Значение.ОграничениеТипа = Объект.ТипЗначения;
		Объект.ТипЗначения.ПривестиЗначение(Значение);
	КонецЕсли;
	Значение = ПланыВидовХарактеристик.бит_НастройкиЗагрузки.ЗначениеНастройки(Объект.Ссылка);
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	МенеджерЗаписи = РегистрыСведений.бит_ЗначенияНастроек.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Настройка = Объект.Ссылка;
	МенеджерЗаписи.Значение = Значение;
	МенеджерЗаписи.Записать(Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗначениеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	Если Объект.ИмяПредопределенныхДанных = "ИмяФайлаЗагрузки" тогда
		ОбработатьНачалоВыбораФайла(СтандартнаяОбработка);
	ИначеЕсли Объект.ИмяПредопределенныхДанных = "ГруппаКонтрагентов" тогда
		

	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьНачалоВыбораФайла(СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	РежимДиалога = РежимДиалогаВыбораФайла.Открытие;
	ДиалогВыбораФайла = Новый ДиалогВыбораФайла(РежимДиалога);
	ДиалогВыбораФайла.ПроверятьСуществованиеФайла = Истина;
	ДиалогВыбораФайла.МножественныйВыбор = Ложь;
	ДиалогВыбораФайла.Заголовок = Нстр("ru = 'Задайте имя файла загрузки из qMS'");
	ДиалогВыбораФайла.ПолноеИмяФайла =  Значение;
	
	ДиалогВыбораФайла.Фильтр = "Формат выгрузки(*.xml)|*.xml";
	Если ДиалогВыбораФайла.Выбрать() Тогда
			Значение = ДиалогВыбораФайла.ПолноеИмяФайла;
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура ЗначениеОткрытие(Элемент, СтандартнаяОбработка)
	Если Объект.ИмяПредопределенныхДанных = "ИмяФайлаЗагрузки" тогда
		ОткрытьВПриложении(Элемент, "ИмяФайлаЗагрузки", СтандартнаяОбработка); 
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьВПриложении(Элемент, ПутьКДанным, СтандартнаяОбработка)

	Файл = Новый Файл(Элемент.ТекстРедактирования); 	
	Если Файл.Существует() Тогда   		
		ЗапуститьПриложение(Элемент.ТекстРедактирования);		
	Иначе 		
		СообщитьПользователю(Нстр("ru = 'Файл не найден'"), ПутьКДанным); 		
	КонецЕсли; 	
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура СообщитьПользователю(Текст, ПутьКДанным = "")
	
	Сообщение = Новый СообщениеПользователю;
	Сообщение.Текст = Текст;
	Сообщение.ПутьКДанным = ПутьКДанным;
	Сообщение.Сообщить();
	
КонецПроцедуры



